In [6]:
import pandas as pd
high_school_types = [{'high school':'griffin','type':'district'},
                    {'high school':'figueroa','type':'district'},
                    {'high school':'wilson','type':'charter'},
                    {'high school':'wright','type':'charter'}]
high_school_types

[{'high school': 'griffin', 'type': 'district'},
 {'high school': 'figueroa', 'type': 'district'},
 {'high school': 'wilson', 'type': 'charter'},
 {'high school': 'wright', 'type': 'charter'}]

In [7]:
for row in high_school_types:
    print(row)

{'high school': 'griffin', 'type': 'district'}
{'high school': 'figueroa', 'type': 'district'}
{'high school': 'wilson', 'type': 'charter'}
{'high school': 'wright', 'type': 'charter'}

In [8]:
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", 
                "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", 
                "Bailey High School", "Holden High School", "Pena High School", "Wright High School",
                "Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]
high_schools

['Huang High School',
 'Figueroa High School',
 'Shelton High School',
 'Hernandez High School',
 'Griffin High School',
 'Wilson High School',
 'Cabrera High School',
 'Bailey High School',
 'Holden High School',
 'Pena High School',
 'Wright High School',
 'Rodriguez High School',
 'Johnson High School',
 'Ford High School',
 'Thomas High School']

In [9]:
high_schools_series = pd.Series(high_schools)

In [10]:
high_schools_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [12]:
for school in high_schools_series:
    print(school)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [13]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [14]:
high_schools_df = pd.DataFrame(high_school_dicts)

In [15]:
high_schools_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [16]:
school_id = [0,1,2,3,4]
school_name = ['huang','figueroa','shelton','hernandez','griffin']
type_of_school = ['district','district','charter','district','charter']

In [20]:
schools_df = pd.DataFrame()
schools_df['school_id']=school_id
schools_df['school_name'] = school_name
schools_df['type'] = type_of_school
schools_df

   school_id school_name      type
0          0       huang  district
1          1    figueroa  district
2          2     shelton   charter
3          3   hernandez  district
4          4     griffin   charter

In [22]:
school_id = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
school_name = ['huang','figueroa','shelton', 'hernandez','griffin','wilson','cabrera','bailey',
               'holden','pena','wright','rodriguez','johnson','ford','thomas']
school_type = ['district','district','charter','district','charter','charter','charter','district',
              'charter','charter','charter','district','district','district','charter']
schools_df = pd.DataFrame()
schools_df['ID'] = school_id
schools_df['Name'] = school_name
schools_df['Type'] = school_type
schools_df

    ID       Name      Type
0    0      huang  district
1    1   figueroa  district
2    2    shelton   charter
3    3  hernandez  district
4    4    griffin   charter
5    5     wilson   charter
6    6    cabrera   charter
7    7     bailey  district
8    8     holden   charter
9    9       pena   charter
10  10     wright   charter
11  11  rodriguez  district
12  12    johnson  district
13  13       ford  district
14  14     thomas   charter